backend/buildfiles/app/Models/NotificationsModel.php

INSERT INTO `notifications` (`notification_reciever_id`, `notification_message`, `notification_link`) VALUES ('2', 'Your image referral has been update. Patient Name is Elliott Thompson and procedure(s) to be performed are Scan Type 1, Scan type 2, Scan type 3', '/doctor/history')
---
    public function sendnotification($reciever, $message, $link, $status){
        $data = [
            'notification_reciever_id' => $reciever,
            'notification_message' => $message,
            'notification_link' => $link,
            'status' => $status
        ];
        $this->insert($data);

SELECT `notification_message`, `notification_date`, `notification_status`, `notification_link`
FROM `notifications`
WHERE `notification_reciever_id` = '2'
ORDER BY `notification_id` DESC
 LIMIT 60
---
    public function getnotifications($id){
        return $this->where('notification_reciever_id', $id)->select('notification_message, notification_date, notification_status, notification_link')->orderby('notification_id', 'DESC')->limit(60)->find();

UPDATE `notifications` SET `notification_status` = 'read'
WHERE `notification_reciever_id` = '2'
AND `notification_link` = '/doctor'
---
    public function markasread($id, $link){
        $this->db->table('notifications')->where('notification_reciever_id', $id)->where('notification_link', $link)->set(['notification_status' => 'read'])->update();