backend/buildfiles/app/Controllers/Admin.php

    public function centers() {
        $centercount = [
            'labs'          => $this->getfacilitycount('lab'),
            'scan'          => $this->getfacilitycount('Scan'),
            'logisitics'    => $this->getfacilitycount('Logistics'),
        ];

        $centers = $this->facilities->orderby('facility_id ', 'DESC')->asObject()->findall();
---
SELECT *
FROM `facilities`
ORDER BY `facility_id` DESC

    private function getfacilitycount($facilitytype){
        return $this->facilities->where('type', $facilitytype)->countallresults();
---
SELECT COUNT(*) AS `numrows`
FROM `facilities`
WHERE `type` = 'lab'