backend/buildfiles/app/Controllers/Admin.php

SELECT `transactions_amount`, SUM(`transactions_amount`) AS `transactions_amount`
FROM `transactions`
WHERE `transactions_type` = 'facility'
AND `transactions_status` = 'unsettled'
SELECT COUNT(*) AS `numrows`
FROM `referrals`
WHERE `referral_status` = 'ongoing'
SELECT `referral_id`, `referral_mode`, `referral_patient_name`, `referral_type`, `referral_procedures`, `referral_additional_notes`, `referral_patient_contact`
FROM `referrals`
WHERE `referral_status` = 'pending'
---
    public function homepage(){
        $stats = [
            'doctorpay'             => ($this->transactions->where('transactions_type', 'doctor')->where('transactions_status', 'unsettled')->select('transactions_amount')->selectsum('transactions_amount')->get()->getrow()->transactions_amount) - ($this->transactions->where('transactions_type', 'doctor')->where('transactions_status', 'settled')->select('transactions_amount')->selectsum('transactions_amount')->get()->getrow()->transactions_amount),
            'centerdue'             => ($this->transactions->where('transactions_type', 'facility')->where('transactions_status', 'unsettled')->select('transactions_amount')->selectsum('transactions_amount')->get()->getrow()->transactions_amount) - ($this->transactions->where('transactions_type', 'facility')->where('transactions_status', 'settled')->select('transactions_amount')->selectsum('transactions_amount')->get()->getrow()->transactions_amount)
        ];
        $this->notifications->markasread(1, '/admin/home');
        return $this->respond([
            'status'                => 200,
            'stats'                 => $stats,
            'pendingreferrals'      => $this->referrals->select('referral_id, referral_mode, referral_patient_name, referral_type, referral_procedures, referral_additional_notes, referral_patient_contact')->where('referral_status', 'pending')->find(),
            'ongoingreferrals'      => $this->referrals->where('referral_status', 'ongoing')->countallresults()
        ]);

SELECT *
FROM `procedures`
WHERE `category` = 'lab'
---
    public function fetchprocedures($procedure){
        return $this->respond([
            'status' => 200,
            'procedures' => $this->procedures->where('category', $procedure)->find(),
        ]);

UPDATE `referrals` SET `referral_type` = 'scan', `referral_patient_name` = 'Elliott Thompson', `referral_patient_age` = '5', `referral_patient_gender` = 'Male', `referral_procedures` = 'Scan Type 1, Scan type 2, Scan type 3', `referral_additional_notes` = 'Consequatur quis am'
WHERE `referrals`.`referral_id` IN (8)
---
    public function upgradequickreferral(){
        $doctorid = $this->referrals->select('referral_doctor_id')->asObject()->find(intval($this->request->getvar('referralid')))->referral_doctor_id;
        $data = [
            'referral_type'             => $this->request->getvar('type'),
            'referral_doctor_hosptial'  => $this->request->getvar('hospital'),
            'referral_patient_name'     => $this->request->getvar('patientname'),
            'referral_patient_age'      => $this->request->getvar('patientage'),
            'referral_patient_gender'   => $this->request->getvar('gender'),
            'referral_procedures'       => implode(', ', $this->request->getvar('procedure')),
            'referral_additional_notes' => $this->request->getvar('additionalnotes'),
        ];

        $this->notifications->sendnotification($doctorid, 'Your image referral has been update. Patient Name is '.$data['referral_patient_name'].' and procedure(s) to be performed are '.$data['referral_procedures'], '/doctor/history', 'unread');
        $this->referrals->update(intval($this->request->getvar('referralid')), $data);

SELECT `referral_doctor_id`
FROM `referrals`
WHERE `referrals`.`referral_id` = 8
---
    public function paydoctor($referralid, $amount){
        $referral_details = $this->referrals->select('referral_doctor_id, referral_patient_name')->asObject()->find($referralid);

INSERT INTO `facilities` (`name`, `type`, `location`, `contact`) VALUES ('Stella Nketsia', 'X-ray', 'Cape Coast', '0555229204')
---
    public function addcenter(){


        $data = [
            'name'                  => $this->request->getvar('name'),
            'type'                  => $this->request->getvar('type'),
            'location'              => $this->request->getvar('location'),
            'contact'               => $this->request->getvar('contact'),
        ];

        $this->facilities->insert($data);

SELECT *
FROM `procedures`
ORDER BY `category`
---
    public function allprocedures(){
        $procedures = $this->procedures->orderby('category')->findall();

SELECT *
FROM `facilities`
WHERE `type` = 'Biopsy and Drainage'
---
    public function fetchcenters($type){
        $facilities = $this->facilities->where('type', $type)->findall();

SELECT `referral_id`, `referral_patient_name`, `referral_doctor_hospital`, `referral_patient_contact`, `referral_procedures`, `name`, `location`, `contact`
FROM `referrals`
JOIN `facilities` ON `referrals`.`referral_facility_id` = `facilities`.`facility_id`
WHERE `referral_status` = 'ongoing'
---
    public function ongoingreferrals(){
        $ongoingreferral = $this->referrals->select('referral_id, referral_patient_name, referral_doctor_hospital, referral_patient_contact, referral_procedures, name, location, contact')->where('referral_status', 'ongoing')->join('facilities', 'referrals.referral_facility_id = facilities.facility_id')->find();

SELECT *
FROM `locations`
---
    public function getlocations(){
        return $this->respond([
            'status' => 200,
            'locations' => $this->locations->findall()
        ]);

SELECT *
FROM `hospitals`
WHERE `hospital_location_id` = '2'
SELECT *
FROM `locations`
WHERE `locations`.`location_id` = '2'
---
    public function gethospitals($townid) {
        $hospitals = $this->hospital->where('hospital_location_id', $townid)->findall();
        $location = $this->locations->asObject()->find($townid)->location_name;

SELECT *
FROM `hospitals`
WHERE `hospital_name` = 'Abura Clinic'
AND `hospital_location_id` = '1'
INSERT INTO `hospitals` (`hospital_name`, `hospital_location_id`, `hospital_location`) VALUES ('Abura Clinic', 1, 'Cape Coast')
---
    public function addhospital(){

        $currentcount = $this->hospital->where('hospital_name', $this->request->getvar('hospitalname'))->where('hospital_location_id', $this->request->getvar('hospitallocationid'))->findall();

        if($currentcount){
            return $this->respond([
                'status' => 304
            ]);
        }

        $data = [
            'hospital_name' => $this->request->getvar('hospitalname'),
            'hospital_location_id' => intval($this->request->getvar('hospitallocationid')),
            'hospital_location' => $this->request->getvar('hospitallocationname'),
        ];

        $this->hospital->insert($data);