backend/buildfiles/app/Controllers/Auth.php

SELECT *
FROM `accounts`
WHERE `email` = 'user1@gmail.com'
 LIMIT 1
---
    public function signin(){
        $accountdets = $this->accounts->where('email', $this->request->getvar('email'))->asObject()->first();