backend/buildfiles/app/Controllers/Doctor.php

SELECT COUNT(*) AS `numrows`
FROM `referrals`
WHERE `referral_doctor_id` = '2'
AND `referral_status` = 'completed'
SELECT COUNT(*) AS `numrows`
FROM `referrals`
WHERE `referral_doctor_id` = '2'
AND `referral_status` = 'pending'
SELECT `referral_patient_name`, `referral_status`, `referral_mode`
FROM `referrals`
WHERE `referral_date` = '2023-02-01'
AND `referral_doctor_id` = '2'
ORDER BY `referral_id` DESC
SELECT COUNT(*) AS `numrows`
FROM `referrals`
WHERE `referral_doctor_id` = '2'
SELECT `verified`
FROM `accounts`
WHERE `accounts`.`account_id` = '2'
SELECT `first_name`, `profile_picture`, `account_balance`
FROM `user_details`
WHERE `user_details`.`user_id` = '2'
---
    public function homepage(){

        $decode         = $this->decodetoken();
        $stats = [
            'total'             => $this->referrals->where('referral_doctor_id', $decode->id)->countallresults(),
            'success'           => $this->referrals->where('referral_doctor_id', $decode->id)->where('referral_status', 'completed')->countallresults(),
            'pending'           => $this->referrals->where('referral_doctor_id', $decode->id)->where('referral_status', 'pending')->countallresults()
        ];

        $referrals = $this->referrals->select('referral_patient_name, referral_status, referral_mode')
                                     ->where('referral_date', date('Y-m-d'))
                                     ->where('referral_doctor_id', $decode->id)
                                     ->orderby('referral_id', 'DESC')->find();

        $this->notifications->markasread($decode->id, '/doctor');
        $this->notifications->markasread($decode->id, '/');

        return $this->respond([
            'status'            => 200,
            'verified'          => intval($this->accounts->select('verified')->asObject()->find($decode->id)->verified),
            'userdetails'       => $this->users->select('first_name, profile_picture, account_balance')->asObject()->find($decode->id),
            'stats'             => $stats,
            'referrals'         => $referrals
        ]);

SELECT *
FROM `procedures`
WHERE `category` = 'biopsyanddrainage'
---
    public function fetchprocedures($procedure){
        $decode         = $this->decodetoken();
        $hospital = $this->users->select('hospital')->asObject()->find($decode->id)->hospital;
        if(!empty($hospital)){
            // $hospital = null;
            $hospital = explode(', ', $this->users->select('hospital')->asObject()->find($decode->id)->hospital);
        }
        return $this->respond([
            'status' => 200,
            'procedures' => $this->procedure->where('category', $procedure)->find(),
            'hospital'  => $hospital
        ]);

SELECT `report_id`, `report_procedure`, `referral_patient_name`, `referral_date`
FROM `reports`
JOIN `referrals` ON `referrals`.`referral_id` = `reports`.`report_referral_id`
WHERE `report_doctor_id` = '2'
AND `report_status` = 'complete'
ORDER BY `report_id` DESC
 LIMIT 200
---
    public function getreports(){
        $decode         = $this->decodetoken();

        $reports = $this->reports->select('report_id, report_procedure, referral_patient_name, referral_date')
                                 ->where('report_doctor_id', $decoded->id)
                                 ->where('report_status', 'complete')
                                 ->orderby('report_id', 'DESC')
                                 ->limit(200)
                                 ->join('referrals', 'referrals.referral_id = reports.report_referral_id')
                                 ->find();

SELECT `transactions_amount`, `transactions_amount_after`, `transactions_status`, `transactions_patient_name`, `transactions_date`
FROM `transactions`
WHERE `transactions_doctor_id` = '3'
ORDER BY `transactions_id` DESC
 LIMIT 50
---
    public function mytransactions(){
        $decode         = $this->decodetoken();

        $transactions = $this->transactions->select('transactions_amount, transactions_amount_after, transactions_status, transactions_patient_name, transactions_date')->where('transactions_doctor_id', $decode->id)->orderby('transactions_id', 'DESC')->limit(50)->find();

SELECT `referral_patient_name`, `referral_procedures`, `referral_status`, `referral_doctor_earned`, `referral_date`, `referral_mode`
FROM `referrals`
WHERE `referral_doctor_id` = '3'
ORDER BY `referral_id` DESC
 LIMIT 40
---
    public function history(){
        $decode         = $this->decodetoken();

        $history = $this->referrals->select('referral_patient_name, referral_procedures, referral_status, referral_doctor_earned, referral_date, referral_mode')->where('referral_doctor_id', $decode->id)->orderby('referral_id', 'DESC')->limit(40)->find();

SELECT `email`
FROM `accounts`
WHERE `accounts`.`account_id` = '2'
SELECT *
FROM `hospitals`
---
    public function profile(){

        $decode         = $this->decodetoken();

        $info = $this->users->select('first_name, last_name, phone_number, profile_picture, account_balance, hospital')->asObject()->find($decode->id);
        $info->email = $this->accounts->select('email')->asObject()->find($decode->id)->email;
        if(empty($info->hospital)){
            $info->hospital = null;
        } else {
            $info->hospital = $info->hospital;
        }

        return $this->respond([
            'status' => 200,
            'info' => $info,
            'hospitals' => $this->hospital->findall()