backend/buildfiles/app/Controllers/Facility.php

SELECT COUNT(*) AS `numrows`
FROM `referrals`
WHERE `referral_facility_id` = '1'
AND `referral_date` = '2022-12-29'
SELECT COUNT(*) AS `numrows`
FROM `referrals`
WHERE `referral_facility_id` = '1'
AND `referral_date` = '2022-12-29'
AND `referral_status` = 'completed'
SELECT COUNT(*) AS `numrows`
FROM `referrals`
WHERE `referral_facility_id` = '1'
AND `referral_date` = '2022-12-29'
AND `referral_status` = 'ongoing'
SELECT `referral_patient_name`, `referral_procedures`, `referral_id`
FROM `referrals`
WHERE `referral_facility_id` = '1'
AND `referral_status` = 'ongoing'
SELECT `due_payment`
FROM `facilities`
WHERE `facilities`.`facility_id` = '1'
---
    public function homepage(){
        $decode         = $this->decodetoken();
        $facilityid             = $this->facilityid($decode->id);

        $stats = [
            'referrals_today'   => $this->referrals->where('referral_facility_id', $facilityid)->where('referral_date', date('Y-m-d'))->countallresults(),
            'completed_today'   => $this->referrals->where('referral_facility_id', $facilityid)->where('referral_date', date('Y-m-d'))->where('referral_status', 'completed')->countallresults(),
            'incomplete_today'  => $this->referrals->where('referral_facility_id', $facilityid)->where('referral_date', date('Y-m-d'))->where('referral_status', 'ongoing')->countallresults(),
        ];

        $data = [
            'userdetails'       => $this->users->select('first_name, profile_picture')->asObject()->find($decode->id),
            'stats'             => $stats,
            'incoming'          => $this->referrals->where('referral_facility_id', $facilityid)->where('referral_status', 'ongoing')->select('referral_patient_name, referral_procedures, referral_id')->find(),
            'payment'           => $this->facilities->select('due_payment')->asObject()->find($facilityid)->due_payment